In [74]:
import pandas as pd
import numpy as np
import os

In [29]:
dic = {'이름':['김수안','김수정','박동윤','강이안','강지안'],
       '나이':[19,23,22,19,16],
       '성별':['여','여','남','여','남'],
       '평점':[4.35,4.23,4.45,4.37,4.25]
      }


data = pd.DataFrame(dic)
data

    이름  나이 성별    평점
0  김수안  19  여  4.35
1  김수정  23  여  4.23
2  박동윤  22  남  4.45
3  강이안  19  여  4.37
4  강지안  16  남  4.25

In [30]:
data['연락처'] = [None,None,None,None,None]

In [31]:
# 값이 하나라도 있는지 확인
data.any(axis = 0)

이름      True
나이      True
성별      True
평점      True
연락처    False
dtype: bool

In [32]:
data.any(axis = 1)

0    True
1    True
2    True
3    True
4    True
dtype: bool

In [33]:
a = pd.DataFrame({'a':[False,False,False,False,False]})
b = pd.DataFrame({'a':[False,False,False,False,True]})
c = pd.DataFrame({'a':[0,0,0,0]})
d = pd.DataFrame({'a':[0,0,0,1]})

print(a.any())
print(b.any())
print(c.any())
print(d.any())

a    False
dtype: bool
a    True
dtype: bool
a    False
dtype: bool
a    True
dtype: bool

In [34]:
# isna와 any를 활용 가능하다
# 즉 전체 데이터의 변수 중에서
# 전부 None값으로 구성되어있는 변수가 무엇인지 구분할 때 사용한다
data.isna().any(axis=0)

이름     False
나이     False
성별     False
평점     False
연락처     True
dtype: bool

In [35]:
# 정수형만 제대로 더해진다
data.sum(axis = 0)

이름     김수안김수정박동윤강이안강지안
나이                  99
성별               여여남여남
평점               21.65
연락처                  0
dtype: object

In [36]:
# 각 변수별로 None 값이 몇개인지 확인 가능하다.
data.isna().sum()

이름     0
나이     0
성별     0
평점     0
연락처    5
dtype: int64

In [37]:
# how='any'  빈 데이터가 행 관점에서 하나라도 있으면 없앤다
# 즉 모든 데이터가 빈 데이터를 가지므로 다 삭제가 된다.
data.dropna(axis=0,how='any')

Empty DataFrame
Columns: [이름, 나이, 성별, 평점, 연락처]
Index: []

In [38]:
# how='any'  빈 데이터가 열 관점에서 하나라도 있으면 없앤다
# 즉 빈데이터가 있는 변수를 없앤다. 
# 실제 저장하려면 inplace = True로 하면 된다
data.dropna(axis=1,how='any')

    이름  나이 성별    평점
0  김수안  19  여  4.35
1  김수정  23  여  4.23
2  박동윤  22  남  4.45
3  강이안  19  여  4.37
4  강지안  16  남  4.25

In [39]:
# 행의 모든 데이터가 None일때 삭제
data.dropna(axis=0,how='all')

    이름  나이 성별    평점   연락처
0  김수안  19  여  4.35  None
1  김수정  23  여  4.23  None
2  박동윤  22  남  4.45  None
3  강이안  19  여  4.37  None
4  강지안  16  남  4.25  None

In [40]:
# 열의 모든 데이터가 None일때 삭제
data.dropna(axis=1,how='all')

    이름  나이 성별    평점
0  김수안  19  여  4.35
1  김수정  23  여  4.23
2  박동윤  22  남  4.45
3  강이안  19  여  4.37
4  강지안  16  남  4.25

In [41]:
data.loc[5] = ['박성호',20,'남',4.5,'010-xxxx-xxxx']

In [43]:
# 열의 모든 데이터가 None일때 삭제
data.dropna(axis=1,how='all')

    이름  나이 성별    평점            연락처
0  김수안  19  여  4.35           None
1  김수정  23  여  4.23           None
2  박동윤  22  남  4.45           None
3  강이안  19  여  4.37           None
4  강지안  16  남  4.25           None
5  박성호  20  남  4.50  010-xxxx-xxxx

In [46]:
# 값이 없을 때 값을 넣는 함수
data.fillna(value='없음')

    이름  나이 성별    평점            연락처
0  김수안  19  여  4.35             없음
1  김수정  23  여  4.23             없음
2  박동윤  22  남  4.45             없음
3  강이안  19  여  4.37             없음
4  강지안  16  남  4.25             없음
5  박성호  20  남  4.50  010-xxxx-xxxx

In [48]:
# 맨 마지막 데이터로 채워 넣는다
data.fillna(method='backfill')

    이름  나이 성별    평점            연락처
0  김수안  19  여  4.35  010-xxxx-xxxx
1  김수정  23  여  4.23  010-xxxx-xxxx
2  박동윤  22  남  4.45  010-xxxx-xxxx
3  강이안  19  여  4.37  010-xxxx-xxxx
4  강지안  16  남  4.25  010-xxxx-xxxx
5  박성호  20  남  4.50  010-xxxx-xxxx

In [60]:
data2 = data[['나이','평점']]

In [61]:
data2.sum()

나이    119.00
평점     26.15
dtype: float64

In [62]:
data2.sum(axis=1)

0    23.35
1    27.23
2    26.45
3    23.37
4    20.25
5    24.50
dtype: float64

In [64]:
# axis로 방향 설정 가능
# str / var / max / min / median 도 사용 가능
data2.mean()

나이    19.833333
평점     4.358333
dtype: float64

In [67]:
# 한번에 계산해주는 함수 축 설정 불가능
data2.describe()

              나이        평점
count   6.000000  6.000000
mean   19.833333  4.358333
std     2.483277  0.106661
min    16.000000  4.230000
25%    19.000000  4.275000
50%    19.500000  4.360000
75%    21.500000  4.430000
max    23.000000  4.500000

In [68]:
# 위에서 몇개만 보기
data.head(3)

    이름  나이 성별    평점   연락처
0  김수안  19  여  4.35  None
1  김수정  23  여  4.23  None
2  박동윤  22  남  4.45  None

In [76]:
file_path = r'C:\Users\tndah\Desktop\대학교\22년 2학년 2학기\파이썬\ToyotaCorolla (1).txt'

In [80]:
# \t로 구분
# csv파일은 ,로 되어있으므로 ,로 구분해야한다.
# read_csv 함수도 존재
dataset = pd.read_table(file_path,sep='\t')
dataset

        Id  Price  Age_08_04     KM    cc  Doors  Weight
0        1  13500         23  46986  2000      3    1165
1        2  13750         23  72937  2000      3    1165
2        3  13950         24  41711  2000      3    1165
3        4  14950         26  48000  2000      3    1165
4        5  13750         30  38500  2000      3    1170
...    ...    ...        ...    ...   ...    ...     ...
1431  1438   7500         69  20544  1300      3    1025
1432  1439  10845         72  19000  1300      3    1015
1433  1440   8500         71  17016  1300      3    1015
1434  1441   7250         70  16916  1300      3    1015
1435  1442   6950         76      1  1600      5    1114

[1436 rows x 7 columns]

In [81]:
# csv파일 쓰기는 데이터.to_csv('경로') 로 파일 생성 가능하다